[{
  "_id": {
    "$oid": "5b8002915b8f1b10d4b666df"
  },
  "currentRating": 0,
  "ratingPoints": 0,
  "ratedCount": 0,
  "ratedBy": [],
  "purchasesCount": 0,
  "comments": [],
  "title": "King Rat (Asian Saga #4)",
  "author": "James Clavell",
  "genre": "Classics",
  "year": 1962,
  "description": "The time is World War II. The place is a brutal prison camp deep in Japanese-occupied territory. Here, within the seething mass of humanity, one man, an American corporal, seeks dominance over both captives and captors alike. His weapons are human courage, unblinking understanding of human weaknesses, and total willingness to exploit every opportunity to enlarge his power and corrupt or destroy anyone who stands in his path.",
  "cover": "https://i.imgur.com/6Pcnx6j.jpg",
  "isbn": "0385333765",
  "pagesCount": 368,
  "price": 16,
  "creationDate": {
    "$date": {
      "$numberLong": "1535115921042"
    }
  },
  "__v": 0
},{
  "_id": {
    "$oid": "5b8002915b8f1b10d4b666e6"
  },
  "currentRating": 0,
  "ratingPoints": 0,
  "ratedCount": 0,
  "ratedBy": [],
  "purchasesCount": 0,
  "comments": [],
  "title": "Metro 2034 (Metro Series #2)",
  "author": "Dmitry Glukhovsky",
  "genre": "Post-apocalyptic",
  "year": 2015,
  "description": "The long-awaited sequel to the cult bestseller Metro 2033, the second volume in the Metro trilogy, Metro 2034 continues the story of survival and struggle that unfolds in the mazes of the Moscow subway after WWIII. As the entire civilization was wiped out by atomic bombs and the surface of the planet is polluted with neclear fallout, the only place suitable for men to live are shelters and bunkers, the largest of which is the subway system of Moscow, aka the Metro. The year is 2034. There's no hope for humans to return to the surface of Earth, to repopulate the forsaken cities, and to become once again the masters of the world they used to be. So they rebuild a strange and grotesque civilization in the tunnels and at the stations of the subway. Stations become city-states that wage trade and war on each other. A fragile equilibrium is established. And then all can be ruined in matter of days. A new horrible threat looms that can eradicate the remains of humanity and end our era. It would take three unlikely heroes to face this menace.",
  "cover": "https://i.imgur.com/ecmAq3i.jpg",
  "isbn": "1473204305",
  "pagesCount": 320,
  "price": 12.59,
  "creationDate": {
    "$date": {
      "$numberLong": "1535115921044"
    }
  },
  "__v": 0
},{
  "_id": {
    "$oid": "5b8002915b8f1b10d4b666e7"
  },
  "currentRating": 0,
  "ratingPoints": 0,
  "ratedCount": 0,
  "ratedBy": [],
  "purchasesCount": 0,
  "comments": [],
  "title": "A Game of Thrones (A Song of Ice and Fire #1)",
  "author": "George R. R. Martin",
  "genre": "Fantasy",
  "year": 1996,
  "description": "Long ago, in a time forgotten, a preternatural event threw the seasons out of balance. In a land where summers can last decades and winters a lifetime, trouble is brewing. The cold is returning, and in the frozen wastes to the north of Winterfell, sinister forces are massing beyond the kingdom’s protective Wall. To the south, the king’s powers are failing—his most trusted adviser dead under mysterious circumstances and his enemies emerging from the shadows of the throne. At the center of the conflict lie the Starks of Winterfell, a family as harsh and unyielding as the frozen land they were born to. Now Lord Eddard Stark is reluctantly summoned to serve as the king’s new Hand, an appointment that threatens to sunder not only his family but the kingdom itself.",
  "cover": "https://i.imgur.com/ezQpwAd.jpg",
  "isbn": "0553103547",
  "pagesCount": 819,
  "price": 10.49,
  "creationDate": {
    "$date": {
      "$numberLong": "1535115921044"
    }
  },
  "__v": 0
},{
  "_id": {
    "$oid": "5b8002915b8f1b10d4b666e8"
  },
  "currentRating": 0,
  "ratingPoints": 0,
  "ratedCount": 0,
  "ratedBy": [],
  "purchasesCount": 0,
  "comments": [],
  "title": "A Dance with Dragons (A Song of Ice and Fire #5)",
  "author": "George R. R. Martin",
  "genre": "Fantasy",
  "year": 2011,
  "description": "In the aftermath of a colossal battle, the future of the Seven Kingdoms hangs in the balance—beset by newly emerging threats from every direction. In the east, Daenerys Targaryen, the last scion of House Targaryen, rules with her three dragons as queen of a city built on dust and death. But Daenerys has thousands of enemies, and many have set out to find her. As they gather, one young man embarks upon his own quest for the queen, with an entirely different goal in mind.",
  "cover": "https://i.imgur.com/lJ65073.jpg",
  "isbn": "9780007456376",
  "pagesCount": 1201,
  "price": 13.94,
  "creationDate": {
    "$date": {
      "$numberLong": "1535115921045"
    }
  },
  "__v": 0
},{
  "_id": {
    "$oid": "5b8002915b8f1b10d4b666e9"
  },
  "currentRating": 0,
  "ratingPoints": 0,
  "ratedCount": 0,
  "ratedBy": [],
  "purchasesCount": 0,
  "comments": [],
  "title": "Cujo",
  "author": "Stephen King",
  "genre": "Horror",
  "year": 1981,
  "description": "Outside a peaceful town in central Maine, a monster is waiting. Cujo is a two-hundred-pound Saint Bernard, the best friend Brett Camber has ever had. One day, Cujo chases a rabbit into a cave inhabited by sick bats and emerges as something new altogether. Meanwhile, Vic and Donna Trenton, and their young son Tad, move to Maine. They are seeking peace and quiet, but life in this small town is not what it seems. As Tad tries to fend off the terror that comes to him at night from his bedroom closet, and as Vic and Donna face their own nightmare of a marriage on the rocks, there is no way they can know that a monster, infinitely sinister, waits in the daylight.",
  "cover": "https://i.imgur.com/Orv5Mmq.jpg",
  "isbn": "1501192248",
  "pagesCount": 400,
  "price": 17,
  "creationDate": {
    "$date": {
      "$numberLong": "1535115921045"
    }
  },
  "__v": 0
},{
  "_id": {
    "$oid": "5b8002915b8f1b10d4b666ea"
  },
  "currentRating": 4,
  "ratingPoints": 4,
  "ratedCount": 1,
  "ratedBy": [],
  "purchasesCount": 0,
  "comments": [],
  "title": "The Da Vinci Code (Robert Langdon #2)",
  "author": "Dan Brown",
  "genre": "Thriller",
  "year": 2003,
  "description": "While in Paris, Harvard symbologist Robert Langdon is awakened by a phone call in the dead of the night. The elderly curator of the Louvre has been murdered inside the museum, his body covered in baffling symbols. As Langdon and gifted French cryptologist Sophie Neveu sort through the bizarre riddles, they are stunned to discover a trail of clues hidden in the works of Leonardo da Vinci—clues visible for all to see and yet ingeniously disguised by the painter.",
  "cover": "https://i.imgur.com/SCLWHCl.jpg",
  "isbn": "0307474275",
  "pagesCount": 597,
  "price": 7.99,
  "creationDate": {
    "$date": {
      "$numberLong": "1535115921045"
    }
  },
  "__v": 0
},{
  "_id": {
    "$oid": "5b8002915b8f1b10d4b666eb"
  },
  "currentRating": 0,
  "ratingPoints": 0,
  "ratedCount": 0,
  "ratedBy": [],
  "purchasesCount": 0,
  "comments": [],
  "title": "Metro 2035 (Metro Series #3)",
  "author": "Dmitry Glukhovsky",
  "genre": "Post-apocalyptic",
  "year": 2016,
  "description": "World War Three wiped out the humankind. The planet is empty now. Huge cities became dust and ashes. Railroads are being eaten by rust. Abandoned satellites hang lonely on the orbit. Radio is mute on all the frequencies. The only survivors of the last war were those who made it into the gates of the Metro, the subway system of Moscow city. It’s there, hundreds of feet below the ground, in the vaults of what was constructed as the world’s largest air-raids shelter that people try to outlive the end of the days. It’s there that they created a new world for themselves. The stations of Metro became city-states, and its citizens, torn apart by religions and ideologies are fighting for the now scarce commodities: air, water, and space. This tiny underground world can only remind humans of an immense world they once were the masters of. It’s been twenty years past Doomsday, and yet the survivors refuse to give up. The most stubborn of them keep cherishing a dream: when the radiation level from nuclear bombings subsides, they will be able to return to the surface and have the life their parents once had.",
  "cover": "https://i.imgur.com/xEYJDiN.jpg",
  "isbn": "1539930726",
  "pagesCount": 502,
  "price": 17.99,
  "creationDate": {
    "$date": {
      "$numberLong": "1535115921046"
    }
  },
  "__v": 0
},{
  "_id": {
    "$oid": "5b8002915b8f1b10d4b666ec"
  },
  "currentRating": 0,
  "ratingPoints": 0,
  "ratedCount": 0,
  "ratedBy": [],
  "purchasesCount": 0,
  "comments": [],
  "title": "The Crossing (Harry Bosch #18)",
  "author": "Michael Connelly",
  "genre": "Crime novel",
  "year": 2015,
  "description": "Six months ago, Harry Bosch left the LAPD before they could fire him, and then hired maverick Defense Attorney Mickey Haller to sue the department for forcing him out. Although it wasn't the way he wanted to go, Harry has to admit that being out of the game has its benefits. Until Mickey asks him to help on one of his cases, and suddenly Harry is back where he belongs, right in the centre of a particularly puzzling murder mystery. The difference is, this time Harry is working for the defense, aiming to prevent the accused, Da'Quan Foster, from being convicted. And not only does the prosecution seem to have a cast-iron case, but having crossed over to 'the dark side' as his former colleagues would put it, Harry is in danger of betraying the very principles he's lived by his whole career.",
  "cover": "https://i.imgur.com/AlpTOHT.jpg",
  "isbn": "1409145875",
  "pagesCount": 432,
  "price": 5.58,
  "creationDate": {
    "$date": {
      "$numberLong": "1535115921059"
    }
  },
  "__v": 0
},{
  "_id": {
    "$oid": "5b8002915b8f1b10d4b666ed"
  },
  "currentRating": 0,
  "ratingPoints": 0,
  "ratedCount": 0,
  "ratedBy": [],
  "purchasesCount": 0,
  "comments": [],
  "title": "Inferno (Robert Langdon #4)",
  "author": "Dan Brown",
  "genre": "Thriller",
  "year": 2013,
  "description": "Harvard professor of symbology Robert Langdon awakens in an Italian hospital, disoriented and with no recollection of the past thirty-six hours, including the origin of the macabre object hidden in his belongings. With a relentless female assassin trailing them through Florence, he and his resourceful doctor, Sienna Brooks, are forced to flee. Embarking on a harrowing journey, they must unravel a series of codes, which are the work of a brilliant scientist whose obsession with the end of the world is matched only by his passion for one of the most influential masterpieces ever written, Dante Alighieri's The Inferno.",
  "cover": "https://i.imgur.com/DePtQrp.jpg",
  "isbn": "1400079152",
  "pagesCount": 624,
  "price": 8.49,
  "creationDate": {
    "$date": {
      "$numberLong": "1535115921075"
    }
  },
  "__v": 0
},{
  "_id": {
    "$oid": "5b8002915b8f1b10d4b666ef"
  },
  "currentRating": 0,
  "ratingPoints": 0,
  "ratedCount": 0,
  "ratedBy": [],
  "purchasesCount": 0,
  "comments": [],
  "title": "Alex Ferguson: My Biography",
  "author": "Sir Alex Ferguson",
  "genre": "Autobiography",
  "year": 2014,
  "description": "Sir Alex Ferguson's compelling story is always honest and revealing he reflects on his managerial career that embraced unprecedented European success for Aberdeen and 26 triumphant seasons with Manchester United. Sir Alex Ferguson's best-selling autobiography has now been updated to offer reflections on events at Manchester United since his retirement as well as his teachings at the Harvard Business School, a night at the Oscars and a boat tour round the Hebrides, where he passed unrecognised. The extra material adds fresh insights and detail on his final years as United's manager. Both the psychology of management and the detail of football strategy at the top level can be complex matters but no-one has explained them in a more interesting and accessible way for the general reader than Sir Alex does here.",
  "cover": "https://i.imgur.com/JCXkMpY.jpg",
  "isbn": "034091940X",
  "pagesCount": 416,
  "price": 11.96,
  "creationDate": {
    "$date": {
      "$numberLong": "1535115921096"
    }
  },
  "__v": 0
}]